wireless-tag-com/8ms-esp32/components/esp-ali-smartliving/ali-smartliving-device-sdk-c/output/release/include/exports/iot_export_diagnosis.h
/* Device Model: 0x0900 ~ 0x09FF */


/****************** Device Diagnosis: used for device diagnosis *******************/

#define DEV_SUPPORT_NONE                    0x00000000    // Device support no optional features
#define DEV_SUPPORT_ERRCODE                 0x00000001    // Device errcode diagnosis
#define DEV_SUPPORT_OFFLINE_OTA             0x00000002    // Device offline OTA repair
#define DEV_SUPPORT_OFFLINE_LOG             0x00000004    // Device offline log diagnosis
#define DEV_SUPPORT_DEVAP_BATCH_PROV        0x00000008    // Device dev ap toc batch provision
#define DEV_SUPPORT_ALL_SERVICE             0xFFFFFFFF    // Device support all optional features

#ifdef DEV_ERRCODE_ENABLE
#define DEV_DIAGNOSIS_ERRCODE               DEV_SUPPORT_ERRCODE
#else
#define DEV_DIAGNOSIS_ERRCODE               DEV_SUPPORT_NONE
#endif

#ifdef DEV_OFFLINE_OTA_ENABLE
#define DEV_DIAGNOSIS_OFFLINE_OTA           DEV_SUPPORT_OFFLINE_OTA
#else
#define DEV_DIAGNOSIS_OFFLINE_OTA           DEV_SUPPORT_NONE
#endif

#ifdef DEV_OFFLINE_LOG_ENABLE
#define DEV_DIAGNOSIS_OFFLINE_LOG           DEV_SUPPORT_OFFLINE_LOG
#else
#define DEV_DIAGNOSIS_OFFLINE_LOG           DEV_SUPPORT_NONE
#endif

#ifdef AWSS_BATCH_DEVAP_ENABLE
#define DEV_DIAGNOSIS_DEVAP_BATCH_PROV      DEV_SUPPORT_DEVAP_BATCH_PROV
#else
#define DEV_DIAGNOSIS_DEVAP_BATCH_PROV      DEV_SUPPORT_NONE
#endif

#define DEV_DIAGNOSIS_SUPPORTED_SERVICE     (DEV_DIAGNOSIS_ERRCODE | DEV_DIAGNOSIS_OFFLINE_OTA \
                                           | DEV_DIAGNOSIS_OFFLINE_LOG | DEV_DIAGNOSIS_DEVAP_BATCH_PROV)

/****************** Device Errcode: used for device diagnosis *********************/

// Device errcode keys
#define DEV_ERRCODE_KEY                     "ErrCode"
#define DEV_ERRCODE_MSG_KEY                 "ErrCodeMsg"

// Device errcode global definitions
#define DEV_ERRCODE_VERSION                 1
#define DEV_ERRCODE_MSG_MAX_LEN             (64)
#define DEV_ERRCODE_TOPIC_RSP_MAX_LEN       (256)
#define DEV_ERRCODE_TOPIC_RSP_FMT           "\"codeVer\":\"%d\",\"state\":%d,\"code\":%d,\"errMsg\":\"%s\",\"signSecretType\":%d,\"sign\":\"%s\""
typedef enum
{
    DEV_ERRCODE_SIGN_TYPE_DS = 0,           // errcode sign type - device secret
    DEV_ERRCODE_SIGN_TYPE_PS = 1,           // errcode sign type - product secret
    DEV_ERRCODE_SIGN_INVALID
} dev_errcode_sign_type_t;

/****************** Device Offline OTA,used for device diagnosis *********************/
#define DEV_OFFLINE_OTA_VERSION                 1
#define DEV_OFFLINE_OTA_MSG_MAX_LEN             (64)
#define DEV_OFFLINE_OTA_TOPIC_RSP_MAX_LEN       (64)
#define DEV_OFFLINE_OTA_TOPIC_RSP_FMT           "\"id\":%s,\"code\":%d,\"data\":{}"

// Device offline OTA Resp definition
typedef enum
{
    DEV_OFFLINE_OTA_RSP_OK = 200,
    DEV_OFFLINE_OTA_RSP_INVALID_PARAM   = 10099,
    DEV_OFFLINE_OTA_RSP_SAME_VERSION    = 10010,
    DEV_OFFLINE_OTA_RSP_DOWNLOAD_FAILED = 10011,
    DEV_OFFLINE_OTA_RSP_VERIFY_FAILED   = 10012,
    DEV_OFFLINE_OTA_RSP_MAX
} dev_offline_ota_resp_t;
// Device state machine definition
typedef enum
{
    DEV_STATE_INIT = 0x00,
    DEV_STATE_WIFI_MONITOR = 0x01,
    DEV_STATE_AWSS = 0x02,
    DEV_STATE_CONNECT_AP = 0x03,
    DEV_STATE_CONNECT_CLOUD = 0x04,
    DEV_STATE_MAX
} dev_state_t;

// Device awss state machine definition
typedef enum
{
    AWSS_STATE_STOP = 0x00,
    AWSS_STATE_START = 0x01,
    AWSS_STATE_COLLECTING_SSID = 0x02,
    AWSS_STATE_SSID_GOT = 0x03,
    AWSS_STATE_MAX
} dev_awss_state_t;

// Device awss pattern
typedef enum
{
    AWSS_PATTERN_SMART_CONFIG = 0x00,
    AWSS_PATTERN_DEV_AP_CONFIG = 0x01,
    AWSS_PATTERN_ZERO_CONFIG = 0x02,
    AWSS_PATTERN_BLE_CONFIG = 0x03,
    AWSS_PATTERN_PHONE_AP_CONFIG = 0x04,
    AWSS_PATTERN_MAX
} dev_awss_pattern_t;

// Device err code definition
#define DEV_ERRCODE_DEFAULT                 0x0000
// DEV_STATE_INIT
// DEV_STATE_WIFI_MONITOR
#define DEV_ERRCODE_WIFI_DRV_FAIL           0xC400
// DEV_STATE_AWSS
#define DEV_ERRCODE_AWSS_START_FAIL         0xC420
/* smart config awss */
#define DEV_ERRCODE_SC_SSID_PWD_GET_TIMEOUT 0xC440
#define DEV_ERRCODE_SC_VERSION_ERR          0xC441
#define DEV_ERRCODE_SC_PKT_CHECK_ERR        0xC442
#define DEV_ERRCODE_SC_SSID_PWD_PARSE_ERR   0xC443
/* dev ap awss */
#define DEV_ERRCODE_DA_DEV_AP_START_FAIL    0xC460
#define DEV_ERRCODE_DA_PEER_CONN_TIMEOUT    0xC461
#define DEV_ERRCODE_DA_SSID_PWD_GET_TIMEOUT 0xC462
#define DEV_ERRCODE_DA_VERSION_ERR          0xC463
#define DEV_ERRCODE_DA_PKT_CHECK_ERR        0xC464
#define DEV_ERRCODE_DA_SSID_PWD_PARSE_ERR   0xC465
#define DEV_ERRCODE_DA_SWITCH_STA_FAIL      0xC466
/* zero config */
#define DEV_ERRCODE_ZC_SSID_PWD_GET_TIMEOUT 0xC480
#define DEV_ERRCODE_ZC_VERSION_ERR          0xC481
#define DEV_ERRCODE_ZC_PKT_CHECK_ERR        0xC482
#define DEV_ERRCODE_ZC_SSID_PWD_PARSE_ERR   0xC483
/* ble awss */
#define DEV_ERRCODE_BA_BLE_ADV_START_FAIL   0xC4A0
#define DEV_ERRCODE_BA_BLE_CONN_FAIL        0xC4A1
#define DEV_ERRCODE_BA_SSID_PWD_GET_TIMEOUT 0xC4A2
#define DEV_ERRCODE_BA_VERSION_ERR          0xC4A3
#define DEV_ERRCODE_BA_PKT_CHECK_ERR        0xC4A4
#define DEV_ERRCODE_BA_SSID_PWD_PARSE_ERR   0xC4A5
#define DEV_ERRCODE_BA_BLE_DISCONN_FAIL     0xC4A6
#define DEV_ERRCODE_BA_BLE_ADV_STOP_FAIL    0xC4A7
/* phone ap awss */
// DEV_STATE_CONNECT_AP
#define DEV_ERRCODE_AP_DISCOVER_FAIL        0xC4E0
#define DEV_ERRCODE_AP_RSSI_TOO_LOW         0xC4E1
#define DEV_ERRCODE_AP_CONN_AUTH_FAIL       0xC4E2
#define DEV_ERRCODE_IP_ADDR_GET_FAIL        0xC4E3
#define DEV_ERRCODE_AP_CONN_LOCAL_NOTI_FAIL 0xC4E4
// DEV_STATE_CONNECT_CLOUD
#define DEV_ERRCODE_HTTPS_INIT_FAIL         0xC500
#define DEV_ERRCODE_HTTPS_DNS_FAIL          0xC501
#define DEV_ERRCODE_HTTPS_PREAUTH_TIMEOUT   0xC502
#define DEV_ERRCODE_HTTPS_DEVAUTH_FAIL      0xC503
#define DEV_ERRCODE_MQTT_INIT_FAIL          0xC504
#define DEV_ERRCODE_MQTT_CONN_TIMEOUT       0xC505
#define DEV_ERRCODE_MQTT_AUTH_FAIL          0xC506
#define DEV_ERRCODE_COAP_INIT_FAIL          0xC507
#define DEV_ERRCODE_TOKEN_RPT_CLOUD_TIMEOUT 0xC508
#define DEV_ERRCODE_TOKEN_RPT_CLOUD_ACK_ERR 0xC509
#define DEV_ERRCODE_TOKEN_GET_LOCAL_PKT_ERR 0xC50A
#define DEV_ERRCODE_TOKEN_GET_LOCAL_RSP_ERR 0xC50B

DLL_IOT_API int dev_diagnosis_module_init();

